#!/usr/bin/env python3
# -*- coding: utf-8 -*-

###########
# Vowels. #
###########
vowels = {
    None: "v",
    "aɪ": "a i",
    "aʊ": "a u",
    "eɪ": "e i",
    "i": "i -",
    "iː": "i -",
    "uː": "u -",
    "æ": "a",
    "ɐ": "a",
    "ɑː": "a",
    "ɒ": "o",
    "ɔɪ": "o i",
    "ɔː": "o -",
    "ə": "a",
    "əʊ": "o",
    "ɛ": "e",
    "ɛə": "e a",
    "ɜː": "e -",
    "ɪ": "i",
    "ɪə": "i a",  # "⚠️", # Very volatile.
    "ʊ": "u",
    "ʊə": "u a",
    "ˈaɪ": "a i",
    "ˈaʊ": "a u",
    "ˈeɪ": "e i",
    "ˈiː": "i -",
    "ˈuː": "u -",
    "ˈæ": "a x",
    "ˈɐ": "a",
    "ˈɑː": "a -",
    "ˈɒ": "o x",
    "ˈɔɪ": "o i",
    "ˈɔː": "o -",
    "ˈə": "a",
    "ˈəʊ": "o -",
    "ˈɛ": "e",
    "ˈɛə": "e a",
    "ˈɜː": "e -",
    "ˈɪ": "i",
    "ˈɪə": "i a",  # "⚠️", # Very volatile.
    "ˈʊ": "u",
    "ˈʊə": "u a",
    "ˌaɪ": "a i",
    "ˌaʊ": "a u",
    "ˌeɪ": "e i",
    "ˌiː": "i -",
    "ˌuː": "u -",
    "ˌæ": "a x",
    "ˌɐ": "a",
    "ˌɑː": "a -",
    "ˌɒ": "o -",
    "ˌɔɪ": "o i",
    "ˌɔː": "o -",
    "ˌəʊ": "o",
    "ˌɛ": "e -",
    "ˌɛə": "e a -",
    "ˌɜː": "e -",
    "ˌɪ": "i -",
    "ˌɪə": "i a",  # "⚠️", # Very volatile.
    "ˌʊ": "u",
    "ˌʊə": "u a",
}
################
# Semi-vowels. #
################
semivowels = {"j": "y", "w": "w"}

###############
# Consonants. #
###############
consonants = {
    "b": "b",
    "d": "d",
    "dʒ": "jy",
    "f": "f",
    "g": "g",
    "h": "h",
    "k": "k",
    "l": "r",
    "m": "m",
    "n": "n",
    "NN": "N",
    "p": "p",
    "s": "s",
    "t": "t",
    "tʃ": "ty",
    "v": "b",
    "z": "z",
    "ð": "z",
    "ŋ": "N",
    "ɹ": "r",
    "ʃ": "sy",
    "ʒ": "jy",
    "θ": "s",
}

#####################
# Special mappings. #
#####################
special = {"NP": "np", "NB": "nb", "TS": "ts"}

####################################################
# Non-geminating symbols (can't take an x before). #
####################################################
non_geminating = {
    **vowels,
    **semivowels,
    **{
        "b": "b",
        "d": "d",
        "ð": "z",
        "f": "f",
        "g": "g",
        "h": "h",
        "dʒ": "jy",
        "l": "r",
        "m": "m",
        "n": "n",
        "NN": "N",
        "ŋ": "N",
        "ɹ": "r",
        "v": "b",
        "z": "z",
        "ʒ": "jy",
        "NP": "np",
        "NB": "nb",
    },
}

#######################
# Symbols to prekana. #
#######################
symb_to_prekana = {**vowels, **semivowels, **consonants, **special}
